app/controllers/alarmas_controller.rb

  def index
    @ficha  = current_usuario.ficha
    @alarmas = Alarma.all
    @estados = Estado.all
---
SELECT * FROM "alarmas"
SELECT * FROM "estados"

  def edit
    @alarma = Alarma.find(params[:id])
---
SELECT * FROM "alarmas" WHERE ("alarmas"."id" = 2)

  def estado
    @alarma = Alarma.modificar_estado(params[:id])
    @alarmas = Alarma.all
---
SELECT * FROM "alarmas"