app/controllers/alarmas_controller.rb

  def show
    @alarma = Alarma.find(params[:id])
---
SELECT * FROM "alarmas" WHERE ("alarmas"."id" = 2)