app/controllers/configuracion_controller.rb

  def index
    @alarmas = Alarma.all
    @estados = Estado.all
    @usuarios = Usuario.all
---
SELECT * FROM "alarmas"
SELECT * FROM "estados"
SELECT * FROM "usuarios"